<a href="https://colab.research.google.com/github/Angepira/AngePira.github.io/blob/main/Clase_22_y_23.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>


# Extracción y data wrangling

En este notebook aprenderás un poco de Data Wrangling, este proceso te ayudará a reunir datos de una variedad de fuentes de datos para limpiarlos, facilitando el acceso y el análisis.

## Indexación Jerárquica

Es una característica de Pandas que proporciona una manera de trabajar con datos de mayor dimensión en una forma de menor dimensión.

In [ ]:
import pandas as pd

In [ ]:
# Crear un diccionario
data = {'Venta': [100, 200, 150, 250, 180, 220],
        'Gastos': [50, 70, 60, 80, 55, 75]}

In [ ]:
data

{'Venta': [100, 200, 150, 250, 180, 220], 'Gastos': [50, 70, 60, 80, 55, 75]}

In [ ]:
#Si converitmos el diccionario en dataframe pandas le asigna el índice
df1 = pd.DataFrame(data)
df1

   Venta  Gastos
0    100      50
1    200      70
2    150      60
3    250      80
4    180      55
5    220      75

In [ ]:
# Creamos el índice con tuplas
index = pd.MultiIndex.from_tuples([('A', '2020'), ('A', '2021'), ('B', '2020'), ('B', '2021'), ('C', '2020'), ('C', '2021')],
                                  names=['Grupo', 'Año'])

In [ ]:
index

MultiIndex([('A', '2020'),
            ('A', '2021'),
            ('B', '2020'),
            ('B', '2021'),
            ('C', '2020'),
            ('C', '2021')],
           names=['Grupo', 'Año'])

In [ ]:
# Crear un DataFrame con indexación jerárquica
df = pd.DataFrame(data, index=index)

# Mostrar el DataFrame con indexación jerárquica
print(df)

            Venta  Gastos
Grupo Año
A     2020    100      50
      2021    200      70
B     2020    150      60
      2021    250      80
C     2020    180      55
      2021    220      75

In [ ]:
#Observa que ya no están estos índices de 0 a 8, si no que ahora los índices
#son los que le asignamoos
df

            Venta  Gastos
Grupo Año
A     2020    100      50
      2021    200      70
B     2020    150      60
      2021    250      80
C     2020    180      55
      2021    220      75

Ahora tranbajemos con pandas series

In [ ]:
#importamos las librerías
import random
import numpy as np

In [ ]:
#Creamos un pandas series con 9 datos aleatorios 
data = pd.Series(np.random.rand(9))

In [ ]:
#observa que pandas crea los índices como números consecutivos
data

0    0.961509
1    0.348698
2    0.374326
3    0.208644
4    0.840502
5    0.918479
6    0.220307
7    0.780638
8    0.488166
dtype: float64

In [ ]:
#Creamos los índices, queremos que nuestro pandas series tenga 2 índices,
#Creamos una lista para cada índice
col_1 = ['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd']
col_2 = ['1', '2', '3', '1', '3', '1', '2', '2', '3']

In [ ]:
#Creamos el pandas series agregando los indices que creamos
data = pd.Series(np.random.rand(9), index=[col_1,col_2])
data

#observa que ya no aparecen los números de 0 a 9, si no los que definimos en las listas

a  1    0.631113
   2    0.091622
   3    0.071823
b  1    0.113841
   3    0.545709
c  1    0.135594
   2    0.944573
d  2    0.746656
   3    0.643181
dtype: float64

In [ ]:
#Aunque los definamos en listas, el objeto multindex tiene tuplas
data.index

MultiIndex([('a', '1'),
            ('a', '2'),
            ('a', '3'),
            ('b', '1'),
            ('b', '3'),
            ('c', '1'),
            ('c', '2'),
            ('d', '2'),
            ('d', '3')],
           )

###### **Cómo acceder a las filas con los índices**

**Para Pandas Series o columnas**

In [ ]:
#Acceder al índice b
data['b']

1    0.873949
3    0.560901
dtype: float64

In [ ]:
#Para acceder a más de un índice utilizamos una tupla
data[('b','1')]

0.873948897648242

In [ ]:
#Podemos a acceder a varios índices consecutivos
data['b':'d']

b  1    0.873949
   3    0.560901
c  1    0.560781
   2    0.128003
d  2    0.181285
   3    0.343642
dtype: float64

In [ ]:
#Podemos utilizar el método loc para acceder a indices consecutivos
data.loc['b':'d']

b  1    0.113841
   3    0.545709
c  1    0.135594
   2    0.944573
d  2    0.746656
   3    0.643181
dtype: float64

In [ ]:
#Podemos utilizar una lista para acceder a índices no consecutivos
data[['b','d']]

b  1    0.113841
   3    0.545709
d  2    0.746656
   3    0.643181
dtype: float64

Para hacer esto mismo con un dataframe debemos filtrar la columna

In [ ]:
#Indexar Pandas Series o una sola columna
df['Venta']['A']

Año
2020    100
2021    200
Name: Venta, dtype: int64

**Para Pandas DataFrame**

In [ ]:
#En este caso debemos apoyarnos en el método loc para selecionar un sólo indice
df.loc['A']

      Venta  Gastos
Año
2020    100      50
2021    200      70

In [ ]:
#También lo podemos hacer para varios índices
df.loc[[('A','2020')]]

            Venta  Gastos
Grupo Año
A     2020    100      50

###### **Reorganizando los datos de un dataframe a través de la indexación jerárquica**

Es útil cuando deseas reorganizar los datos de un DataFrame con indexación jerárquica para tener una estructura más fácil de trabajar o cuando necesitas realizar cálculos o análisis en los datos desapilados.

In [ ]:
#Para el caso del dataframe
df.unstack()

      Ventas      Gastos
Año     2020 2021   2020 2021
Grupo
A        100  200     50   70
B        150  250     60   80

In [ ]:
#También puedo reorganizar una sola columna
df['Ventas'].unstack()

Año    2020  2021
Grupo
A       100   200
B       150   250

In [ ]:
#Para el caso del pandas series me lo convierte en un dataFrame
data.unstack()

          1         2         3
a  0.631113  0.091622  0.071823
b  0.113841       NaN  0.545709
c  0.135594  0.944573       NaN
d       NaN  0.746656  0.643181

In [ ]:
type(data.unstack())

pandas.core.frame.DataFrame

## Combinar y fusionar Datasets

#### concat
Pandas tiene una función, ``pd.concat()``, que tiene una sintaxis similar a ``np.concatenate`` pero contiene una diferentes argumentos.

``pd.concat()`` puede ser usado para una concatenacion simple de ``Series`` o ``DataFrames``:

In [ ]:
#Creamos el dataframe df1 donde seleccionamos una parte del dataframe según unas condiciones

df1 = titanic[(titanic.Age > 18) & (titanic['Age'] < 50)][10:15][['PassengerId','Survived']]
df1

    PassengerId  Survived
21           22         1
23           24         1
25           26         1
27           28         0
30           31         0

In [ ]:
df1.reset_index()

   index  PassengerId  Survived
0     21           22         1
1     23           24         1
2     25           26         1
3     27           28         0
4     30           31         0

In [ ]:
df1

   index  PassengerId  Survived
0     21           22         1
1     23           24         1
2     25           26         1
3     27           28         0
4     30           31         0

In [ ]:
#Creamos un segundo dataframe donde filtramos el titanic por la posición de los registros
df2 = titanic.iloc[10:15,2:5]
df2

    Pclass                                  Name     Sex
10       3       Sandstrom, Miss. Marguerite Rut  female
11       1              Bonnell, Miss. Elizabeth  female
12       3        Saundercock, Mr. William Henry    male
13       3           Andersson, Mr. Anders Johan    male
14       3  Vestrom, Miss. Hulda Amanda Adolfina  female

In [ ]:
#Hacemos reset index, para que los índices de cada registro inicien desde cero y así poder concatenar los dataframes
df1.reset_index(inplace = True)
df1

   index  PassengerId  Survived
0     21           22         1
1     23           24         1
2     25           26         1
3     27           28         0
4     30           31         0

In [ ]:
#Hacemos reset index, para que los índices de cada registro inicien desde cero y así poder concatenar los dataframes
df2.reset_index(inplace = True)
df2

   index  Pclass                                  Name     Sex
0     10       3       Sandstrom, Miss. Marguerite Rut  female
1     11       1              Bonnell, Miss. Elizabeth  female
2     12       3        Saundercock, Mr. William Henry    male
3     13       3           Andersson, Mr. Anders Johan    male
4     14       3  Vestrom, Miss. Hulda Amanda Adolfina  female

In [ ]:
#Aquí concatenamos el df1 y el df2  por columnas considerando el índice
pd.concat([df1, df2],ignore_index=False,sort=True, axis=1)

   index  PassengerId  ...                                  Name     Sex
0     21           22  ...       Sandstrom, Miss. Marguerite Rut  female
1     23           24  ...              Bonnell, Miss. Elizabeth  female
2     25           26  ...        Saundercock, Mr. William Henry    male
3     27           28  ...           Andersson, Mr. Anders Johan    male
4     30           31  ...  Vestrom, Miss. Hulda Amanda Adolfina  female

[5 rows x 7 columns]

In [ ]:
#Aquí concatenamos el df1 y el df2  por columnas considerando el índice
pd.concat([df1, df2],ignore_index=False,sort=True, axis=0)

                                   Name  PassengerId  ...  Survived index
0                                   NaN         22.0  ...       1.0    21
1                                   NaN         24.0  ...       1.0    23
2                                   NaN         26.0  ...       1.0    25
3                                   NaN         28.0  ...       0.0    27
4                                   NaN         31.0  ...       0.0    30
0       Sandstrom, Miss. Marguerite Rut          NaN  ...       NaN    10
1              Bonnell, Miss. Elizabeth          NaN  ...       NaN    11
2        Saundercock, Mr. William Henry          NaN  ...       NaN    12
3           Andersson, Mr. Anders Johan          NaN  ...       NaN    13
4  Vestrom, Miss. Hulda Amanda Adolfina          NaN  ...       NaN    14

[10 rows x 6 columns]

- ¿Qué pasa si no hago reset_index a los dataframes?
- ¿Qué pasa si cambio los argumentos ignore_index, sort y axis?
- ¿Qué pasa si no utilizo los argumentos anteriores?

In [ ]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR'},
                         {'Name': 'Sally', 'Role': 'Course liasion'},
                         {'Name': 'James', 'Role': 'Grader'}])
staff_df = staff_df.set_index('Name')
student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business'},
                           {'Name': 'Mike', 'School': 'Law'},
                           {'Name': 'Sally', 'School': 'Engineering'}])
student_df = student_df.set_index('Name')

In [ ]:
#Concatena los dataframes staff_df y student_df

Respuesta:

|       | Role           | Scool    |   |   |
|-------|----------------|----------|---|---|
| James | Grader         | Business |   |   |
| Kelly | Director of HR | NaN      |   |   |
| Mike  | NaN            | Law      |   |   |
| Sally | Course liasion | Engineering|   |   |

In [ ]:
#Crea tus propios Dataframes y concatenalos

#### Merge and join



Ambas funciones permiten que los datos de diferentes dataframes se combinen en uno solo de acuerdo con una regla de "cruce" o "búsqueda".

Aunque tanto `merge` como` join` hacen cosas similares, la forma en que lo hacen es diferente.

La función `merge` es la función predeterminada de pandas para unir datos. Básicamente es contraparte de *pandas de la unión de SQL*, y requiere la especificación de qué columnas de ambos dataframes se compararán. A Merge no le importa en absoluto los índices definidos en ellos.

Por otro lado, la función `join` de Panda es más conveniente (incluso utiliza merge internamente), unir es básicamente hacer una fusión aprovechando los índices de ambos marcos de datos.

La siguiente figura resume los diferentes 4 tipos de combinaciones: _inner, outer, left and right_.

![MERGE](http://www.datasciencemadesimple.com/wp-content/uploads/2017/09/join-or-merge-in-python-pandas-1.png)

La función merge también está disponible como método en la clase `DataFrame`.
La sintaxis básica es:

```
new_joined_df = df.merge (another_df, left_on = "col_in_df", right_on = "col_in_another_df",
                          how="inner"|"left"|"right"|"outer")
```

El primer argumento (`another_df`), así como` left_on` y `right_on` son argumentos obligatorios.
`left_on` especifica un nombre de columna en el dataframe `df` cuyos valores deben coincidir con
los de la columna `another_df` 'especificados en `right_on`.

El argumento `how` es opcional y por defecto es `inner`.

In [ ]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR'},
                         {'Name': 'Sally', 'Role': 'Course liasion'},
                         {'Name': 'James', 'Role': 'Grader'}])
staff_df = staff_df.set_index('Name')
student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business'},
                           {'Name': 'Mike', 'School': 'Law'},
                           {'Name': 'Sally', 'School': 'Engineering'}])
student_df = student_df.set_index('Name')

In [ ]:
#Mira el dataframe staff_df
staff_df.head()

                 Role
Name
Kelly  Director of HR
Sally  Course liasion
James          Grader

In [ ]:
#Mira el dataframe student_df
student_df.head()

            School
Name
James     Business
Mike           Law
Sally  Engineering

In [ ]:
pd.merge(staff_df, student_df,left_index=True, right_index=True)

                 Role       School
Name
Sally  Course liasion  Engineering
James          Grader     Business

¿Por qué trae solo dos registros?

In [ ]:
pd.merge(staff_df, student_df, how='outer', left_index=True, right_index=True)

                 Role       School
Name
James          Grader     Business
Kelly  Director of HR          NaN
Mike              NaN          Law
Sally  Course liasion  Engineering

¿Por qué trae 4 registros?

In [ ]:
pd.merge(staff_df, student_df, how='left', left_index=True, right_index=True)

                 Role       School
Name
Kelly  Director of HR          NaN
Sally  Course liasion  Engineering
James          Grader     Business

¿Por qué trae 3 registros?

In [ ]:
pd.merge(staff_df, student_df, how='right', left_index=True, right_index=True)

                 Role       School
Name
James          Grader     Business
Mike              NaN          Law
Sally  Course liasion  Engineering

¿Por qué trae 3 registros

In [ ]:
staff_df = staff_df.reset_index()
student_df = student_df.reset_index()

¿Porqué hago reset_index? ¿qué pasa con los dataframes?

In [ ]:
#Mira el dataframe staff_df y compararlo con el anterior

In [ ]:
#Mira el dataframe student_df y compararlo con el anterior

In [ ]:
pd.merge(staff_df, student_df, how="left", left_on="Name", right_on="Name")

    Name            Role       School
0  Kelly  Director of HR          NaN
1  Sally  Course liasion  Engineering
2  James          Grader     Business

*¿Cuál es la diferencia entre left_on y left_index? ¿Cuándo debo usar uno o el otro?*

In [ ]:
pd.merge(staff_df, student_df, how="left",on="Name")

    Name            Role       School
0  Kelly  Director of HR          NaN
1  Sally  Course liasion  Engineering
2  James          Grader     Business

Ahora vamos a cruzar por más de una característica

In [ ]:
staff_df = pd.DataFrame([{'First Name': 'Kelly', 'Last Name': 'Desjardins', 'Role': 'Director of HR'},
                         {'First Name': 'Sally', 'Last Name': 'Brooks', 'Role': 'Course liasion'},
                         {'First Name': 'James', 'Last Name': 'Wilde', 'Role': 'Grader'}])

In [ ]:
student_df = pd.DataFrame([{'First Name': 'James', 'Last Name': 'Hammond', 'School': 'Business'},
                           {'First Name': 'Mike', 'Last Name': 'Smith', 'School': 'Law'},
                           {'First Name': 'Sally', 'Last Name': 'Brooks', 'School': 'Engineering'}])

In [ ]:
staff_df

  First Name   Last Name            Role
0      Kelly  Desjardins  Director of HR
1      Sally      Brooks  Course liasion
2      James       Wilde          Grader

In [ ]:
student_df

  First Name Last Name       School
0      James   Hammond     Business
1       Mike     Smith          Law
2      Sally    Brooks  Engineering

In [ ]:
pd.merge(staff_df, student_df, how='inner', left_on=['First Name','Last Name'], right_on=['First Name','Last Name'])

  First Name Last Name            Role       School
0      Sally    Brooks  Course liasion  Engineering

Inténtalo tu:
Dados los siguientes dataframes has todos los joins: inner, outter, left y right, con índice y con reset index

Nota: Debes hacer todo lo que hiciste arriba

In [ ]:
tiendas = pd.DataFrame([{'Tienda': 'Mi Tiendita', 'Ciudad': 'Buenos Aires', 'Productos': 'Zapatos'},
                         {'Tienda': 'Supertienda', 'Ciudad': 'Rosario', 'Productos': 'Comida'},
                         {'Tienda': 'Tienda Misteriosa', 'Ciudad': 'Rosario', 'Productos': 'Comida'},
                         {'Tienda': 'Tienda de la vida', 'Ciudad': 'Córdoba', 'Productos': 'Camisas'}])

In [ ]:
ventas = pd.DataFrame([{'Nombre': 'La Tienda', 'Ganancias': '-3000', 'Ventas': '6000'},
                         {'Nombre': 'Supertienda', 'Ganancias': '200', 'Ventas': '8000'},
                         {'Nombre': 'Tienda', 'Ganancias': '1000', 'Ventas': '5000'}])

In [ ]:
#Ponemos 'Tienda' como el índice del dataframe 'tiendas'
tiendas = tiendas.set_index('Tienda')

In [ ]:
#Pon 'Nombre' como el índice del dataframe 'ventas'

Respuesta

|             | Ganancias | Ventas |
|-------------|-----------|--------|
| Nombre      |           |        |
| La Tienda   | -3000     | 6000   |
| Supertienda | 200       | 8000   |
| Tienda      | 1000      | 5000   |

In [ ]:
#Inner join

In [ ]:
#Outter join

In [ ]:
#Left join

In [ ]:
#Right join

In [ ]:
#Reset index en ambos data frames

In [ ]:
#Inner join

In [ ]:
#Outter join

In [ ]:
#Left join

In [ ]:
#Right join

## Remodelar o Reshaping

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
np.arange(6).reshape(2,3)

array([[0, 1, 2],
       [3, 4, 5]])

In [ ]:
data = pd.DataFrame(np.arange(6).reshape(2,3), 
                    index=pd.Index(['Ohio', 'Colorado'], name='state'),
                    columns=pd.Index(['one','two','three'], name='number'))

In [ ]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [ ]:
result = data.stack()

In [ ]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [ ]:
type(result)

pandas.core.series.Series

In [ ]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

## Reducción de dimensionalidad

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.decomposition import PCA
from sklearn.preprocessing import StandardScaler

In [ ]:
plt.rcParams['figure.figsize'] = (16,9)
plt.style.use('ggplot')

In [ ]:
dataframe = pd.read_csv()